app/controllers/requests_controller.rb

SELECT * FROM `requests`
---
  def index
    @requests = Request.all

SELECT * FROM `requests` WHERE (`requests`.`id` = 1)
---
  def show
    @request = Request.find(params[:id])

SELECT * FROM `requests` WHERE (`requests`.`id` = 1)
---
  def edit
    @request = Request.find(params[:id])

INSERT INTO `requests` (`updated_at`, `delete_flg`, `shop_id`, `rate`, `location_id`, `category_id`, `user_id`, `created_at`) VALUES('2009-06-08 10:21:38', NULL, NULL, NULL, NULL, NULL, NULL, '2009-06-08 10:21:38')
---
  def create
    @request = Request.new(params[:request])

    respond_to do |format|
      if @request.save

SELECT * FROM `requests` WHERE (`requests`.`id` = 1)
---
  def update
    @request = Request.find(params[:id])

SELECT * FROM `requests` WHERE (`requests`.`id` = 1)
DELETE FROM `requests` WHERE `id` = 1
---
  def destroy
    @request = Request.find(params[:id])
    @request.destroy