app/controllers/shops_controller.rb

  def index
    @shops = Shop.all
---
SELECT * FROM `shops`

  def show
    @shop = Shop.find(params[:id])
---
SELECT * FROM `shops` WHERE (`shops`.`id` = 953125641)

  def edit
    @shop = Shop.find(params[:id])
---
SELECT * FROM `shops` WHERE (`shops`.`id` = 953125641)

  def create
    @shop = Shop.new(params[:shop])

    respond_to do |format|
      if @shop.save
---
INSERT INTO `shops` (`tabelog_mobile_url`, `total_score`, `service_score`, `situation`, `category`, `latitude`, `updated_at`, `restaurant_name`, `lunch_price`, `taste_score`, `tel`, `business_hours`, `holiday`, `rcd`, `tabelog_url`, `longitude`, `address`, `mood_score`, `dinner_price`, `station_id`, `created_at`) VALUES(NULL, NULL, NULL, NULL, NULL, NULL, '2009-06-08 11:43:56', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2009-06-08 11:43:56')

  def update
    @shop = Shop.find(params[:id])
---
SELECT * FROM `shops` WHERE (`shops`.`id` = 953125641)

  def destroy
    @shop = Shop.find(params[:id])
    @shop.destroy
---
SELECT * FROM `shops` WHERE (`shops`.`id` = 953125641)
DELETE FROM `shops` WHERE `id` = 953125641