app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `delete_flg`, `remember_token_expires_at`, `remember_token`, `email`, `created_at`) VALUES('MyString', NULL, '2009-06-08 10:28:04', NULL, NULL, NULL, NULL, 'MyString', '2009-06-08 10:28:04')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `email` = 'h-kondo@webshark.co.jp', `updated_at` = '2009-05-19 14:23:20', `name` = 'snusmum' WHERE `id` = 2